Sunewst/garden-board/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################


garden_board_esp32c6.name=ESP32-C6 Garden Board


garden_board_esp32c6.bootloader.tool=esptool_py
garden_board_esp32c6.bootloader.tool.default=esptool_py

garden_board_esp32c6.upload.tool=esptool_py
garden_board_esp32c6.upload.tool.default=esptool_py
garden_board_esp32c6.upload.tool.network=esp_ota

garden_board_esp32c6.upload.maximum_size=1310720
garden_board_esp32c6.upload.maximum_data_size=327680
garden_board_esp32c6.upload.flags=
garden_board_esp32c6.upload.extra_flags=
garden_board_esp32c6.upload.use_1200bps_touch=false
garden_board_esp32c6.upload.wait_for_upload_port=false

garden_board_esp32c6.serial.disableDTR=false
garden_board_esp32c6.serial.disableRTS=false

garden_board_esp32c6.build.tarch=riscv32
garden_board_esp32c6.build.target=esp
garden_board_esp32c6.build.mcu=esp32c6
garden_board_esp32c6.build.core=esp32
garden_board_esp32c6.build.variant=garden_board_esp32c6
garden_board_esp32c6.build.board=GARDEN_BOARD_ESP32C6
garden_board_esp32c6.build.bootloader_addr=0x0

garden_board_esp32c6.build.cdc_on_boot=0
garden_board_esp32c6.build.f_cpu=160000000L
garden_board_esp32c6.build.flash_size=4MB
garden_board_esp32c6.build.flash_freq=80m
garden_board_esp32c6.build.flash_mode=qio
garden_board_esp32c6.build.boot=qio
garden_board_esp32c6.build.partitions=default
garden_board_esp32c6.build.defines=

## IDE 2.0 Seems to not update the value
garden_board_esp32c6.menu.JTAGAdapter.default=Disabled
garden_board_esp32c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
garden_board_esp32c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
garden_board_esp32c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
garden_board_esp32c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
garden_board_esp32c6.menu.JTAGAdapter.external=FTDI Adapter
garden_board_esp32c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
garden_board_esp32c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
garden_board_esp32c6.menu.JTAGAdapter.bridge=ESP USB Bridge
garden_board_esp32c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
garden_board_esp32c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

garden_board_esp32c6.menu.CDCOnBoot.default=Disabled
garden_board_esp32c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
garden_board_esp32c6.menu.CDCOnBoot.cdc=Enabled
garden_board_esp32c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

garden_board_esp32c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.default.build.partitions=default
garden_board_esp32c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
garden_board_esp32c6.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
garden_board_esp32c6.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
garden_board_esp32c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.minimal.build.partitions=minimal
garden_board_esp32c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
garden_board_esp32c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
garden_board_esp32c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
garden_board_esp32c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
garden_board_esp32c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
garden_board_esp32c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
garden_board_esp32c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
garden_board_esp32c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
garden_board_esp32c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
garden_board_esp32c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
garden_board_esp32c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
garden_board_esp32c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
garden_board_esp32c6.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.fatflash.build.partitions=ffat
garden_board_esp32c6.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
garden_board_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
garden_board_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
garden_board_esp32c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
garden_board_esp32c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
garden_board_esp32c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
garden_board_esp32c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
garden_board_esp32c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
garden_board_esp32c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
garden_board_esp32c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
garden_board_esp32c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
garden_board_esp32c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
garden_board_esp32c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
garden_board_esp32c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
garden_board_esp32c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
garden_board_esp32c6.menu.PartitionScheme.custom=Custom
garden_board_esp32c6.menu.PartitionScheme.custom.build.partitions=
garden_board_esp32c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

