Sunewst/garden-board/boards.txt
garden_board_esp32c6.menu.CPUFreq.160=160MHz (WiFi)
garden_board_esp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
garden_board_esp32c6.menu.CPUFreq.120=120MHz (WiFi)
garden_board_esp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
garden_board_esp32c6.menu.CPUFreq.80=80MHz (WiFi)
garden_board_esp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
garden_board_esp32c6.menu.CPUFreq.40=40MHz
garden_board_esp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
garden_board_esp32c6.menu.CPUFreq.20=20MHz
garden_board_esp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
garden_board_esp32c6.menu.CPUFreq.10=10MHz
garden_board_esp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

garden_board_esp32c6.menu.FlashMode.qio=QIO
garden_board_esp32c6.menu.FlashMode.qio.build.flash_mode=dio
garden_board_esp32c6.menu.FlashMode.qio.build.boot=qio
garden_board_esp32c6.menu.FlashMode.dio=DIO
garden_board_esp32c6.menu.FlashMode.dio.build.flash_mode=dio
garden_board_esp32c6.menu.FlashMode.dio.build.boot=dio

garden_board_esp32c6.menu.FlashFreq.80=80MHz
garden_board_esp32c6.menu.FlashFreq.80.build.flash_freq=80m
garden_board_esp32c6.menu.FlashFreq.40=40MHz
garden_board_esp32c6.menu.FlashFreq.40.build.flash_freq=40m

garden_board_esp32c6.menu.UploadSpeed.921600=921600
garden_board_esp32c6.menu.UploadSpeed.921600.upload.speed=921600
garden_board_esp32c6.menu.UploadSpeed.115200=115200
garden_board_esp32c6.menu.UploadSpeed.115200.upload.speed=115200
garden_board_esp32c6.menu.UploadSpeed.256000.windows=256000
garden_board_esp32c6.menu.UploadSpeed.256000.upload.speed=256000
garden_board_esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
garden_board_esp32c6.menu.UploadSpeed.230400=230400
garden_board_esp32c6.menu.UploadSpeed.230400.upload.speed=230400
garden_board_esp32c6.menu.UploadSpeed.460800.linux=460800
garden_board_esp32c6.menu.UploadSpeed.460800.macosx=460800
garden_board_esp32c6.menu.UploadSpeed.460800.upload.speed=460800
garden_board_esp32c6.menu.UploadSpeed.512000.windows=512000
garden_board_esp32c6.menu.UploadSpeed.512000.upload.speed=512000

garden_board_esp32c6.menu.DebugLevel.none=None
garden_board_esp32c6.menu.DebugLevel.none.build.code_debug=0
garden_board_esp32c6.menu.DebugLevel.error=Error
garden_board_esp32c6.menu.DebugLevel.error.build.code_debug=1
garden_board_esp32c6.menu.DebugLevel.warn=Warn
garden_board_esp32c6.menu.DebugLevel.warn.build.code_debug=2
garden_board_esp32c6.menu.DebugLevel.info=Info
garden_board_esp32c6.menu.DebugLevel.info.build.code_debug=3
garden_board_esp32c6.menu.DebugLevel.debug=Debug
garden_board_esp32c6.menu.DebugLevel.debug.build.code_debug=4
garden_board_esp32c6.menu.DebugLevel.verbose=Verbose
garden_board_esp32c6.menu.DebugLevel.verbose.build.code_debug=5

garden_board_esp32c6.menu.EraseFlash.none=Disabled
garden_board_esp32c6.menu.EraseFlash.none.upload.erase_cmd=
garden_board_esp32c6.menu.EraseFlash.all=Enabled
garden_board_esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

garden_board_esp32c6.menu.ZigbeeMode.default=Disabled
garden_board_esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
garden_board_esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
garden_board_esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
garden_board_esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
garden_board_esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
garden_board_esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
garden_board_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
garden_board_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################

garden_board_esp32c6_revision.name=ESP32-C6 Garden Board Revision


garden_board_esp32c6_revision.bootloader.tool=esptool_py
garden_board_esp32c6_revision.bootloader.tool.default=esptool_py

garden_board_esp32c6_revision.upload.tool=esptool_py
garden_board_esp32c6_revision.upload.tool.default=esptool_py
garden_board_esp32c6_revision.upload.tool.network=esp_ota

garden_board_esp32c6_revision.upload.maximum_size=1310720
garden_board_esp32c6_revision.upload.maximum_data_size=327680
garden_board_esp32c6_revision.upload.flags=
garden_board_esp32c6_revision.upload.extra_flags=
garden_board_esp32c6_revision.upload.use_1200bps_touch=false
garden_board_esp32c6_revision.upload.wait_for_upload_port=false

garden_board_esp32c6_revision.serial.disableDTR=false
garden_board_esp32c6_revision.serial.disableRTS=false

garden_board_esp32c6_revision.build.tarch=riscv32
garden_board_esp32c6_revision.build.target=esp
garden_board_esp32c6_revision.build.mcu=esp32c6
garden_board_esp32c6_revision.build.core=esp32
garden_board_esp32c6_revision.build.variant=garden_board_esp32c6_revision
garden_board_esp32c6_revision.build.board=GARDEN_BOARD_ESP32C6_REVISION
garden_board_esp32c6_revision.build.bootloader_addr=0x0

garden_board_esp32c6_revision.build.cdc_on_boot=0
garden_board_esp32c6_revision.build.f_cpu=160000000L
garden_board_esp32c6_revision.build.flash_size=4MB
garden_board_esp32c6_revision.build.flash_freq=80m
garden_board_esp32c6_revision.build.flash_mode=qio
garden_board_esp32c6_revision.build.boot=qio
garden_board_esp32c6_revision.build.partitions=default
garden_board_esp32c6_revision.build.defines=

garden_board_esp32c6_revision.menu.JTAGAdapter.default=Disabled
garden_board_esp32c6_revision.menu.JTAGAdapter.default.build.copy_jtag_files=0
garden_board_esp32c6_revision.menu.JTAGAdapter.builtin=Integrated USB JTAG
garden_board_esp32c6_revision.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
garden_board_esp32c6_revision.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
garden_board_esp32c6_revision.menu.JTAGAdapter.external=FTDI Adapter
garden_board_esp32c6_revision.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
garden_board_esp32c6_revision.menu.JTAGAdapter.external.build.copy_jtag_files=1
garden_board_esp32c6_revision.menu.JTAGAdapter.bridge=ESP USB Bridge
garden_board_esp32c6_revision.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
garden_board_esp32c6_revision.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

garden_board_esp32c6_revision.menu.CDCOnBoot.default=Disabled
garden_board_esp32c6_revision.menu.CDCOnBoot.default.build.cdc_on_boot=0
garden_board_esp32c6_revision.menu.CDCOnBoot.cdc=Enabled
garden_board_esp32c6_revision.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

garden_board_esp32c6_revision.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.default.build.partitions=default
garden_board_esp32c6_revision.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
garden_board_esp32c6_revision.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
garden_board_esp32c6_revision.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
garden_board_esp32c6_revision.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
garden_board_esp32c6_revision.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.minimal.build.partitions=minimal
garden_board_esp32c6_revision.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.no_ota.build.partitions=no_ota
garden_board_esp32c6_revision.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
garden_board_esp32c6_revision.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
garden_board_esp32c6_revision.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
garden_board_esp32c6_revision.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
garden_board_esp32c6_revision.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
garden_board_esp32c6_revision.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
garden_board_esp32c6_revision.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
garden_board_esp32c6_revision.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
garden_board_esp32c6_revision.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
garden_board_esp32c6_revision.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.huge_app.build.partitions=huge_app
garden_board_esp32c6_revision.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
garden_board_esp32c6_revision.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
garden_board_esp32c6_revision.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
garden_board_esp32c6_revision.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
garden_board_esp32c6_revision.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
garden_board_esp32c6_revision.menu.PartitionScheme.fatflash.build.partitions=ffat
garden_board_esp32c6_revision.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
garden_board_esp32c6_revision.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
garden_board_esp32c6_revision.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
garden_board_esp32c6_revision.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
garden_board_esp32c6_revision.menu.PartitionScheme.rainmaker=RainMaker 4MB
garden_board_esp32c6_revision.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
garden_board_esp32c6_revision.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
garden_board_esp32c6_revision.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
garden_board_esp32c6_revision.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
garden_board_esp32c6_revision.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
garden_board_esp32c6_revision.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
garden_board_esp32c6_revision.menu.PartitionScheme.zigbee.build.partitions=zigbee
garden_board_esp32c6_revision.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
garden_board_esp32c6_revision.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
garden_board_esp32c6_revision.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
garden_board_esp32c6_revision.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
garden_board_esp32c6_revision.menu.PartitionScheme.custom=Custom
garden_board_esp32c6_revision.menu.PartitionScheme.custom.build.partitions=
garden_board_esp32c6_revision.menu.PartitionScheme.custom.upload.maximum_size=16777216

garden_board_esp32c6_revision.menu.CPUFreq.160=160MHz (WiFi)
garden_board_esp32c6_revision.menu.CPUFreq.160.build.f_cpu=160000000L
garden_board_esp32c6_revision.menu.CPUFreq.120=120MHz (WiFi)
garden_board_esp32c6_revision.menu.CPUFreq.120.build.f_cpu=120000000L
garden_board_esp32c6_revision.menu.CPUFreq.80=80MHz (WiFi)
garden_board_esp32c6_revision.menu.CPUFreq.80.build.f_cpu=80000000L
garden_board_esp32c6_revision.menu.CPUFreq.40=40MHz
garden_board_esp32c6_revision.menu.CPUFreq.40.build.f_cpu=40000000L
garden_board_esp32c6_revision.menu.CPUFreq.20=20MHz
garden_board_esp32c6_revision.menu.CPUFreq.20.build.f_cpu=20000000L
garden_board_esp32c6_revision.menu.CPUFreq.10=10MHz
garden_board_esp32c6_revision.menu.CPUFreq.10.build.f_cpu=10000000L

garden_board_esp32c6_revision.menu.FlashMode.qio=QIO
garden_board_esp32c6_revision.menu.FlashMode.qio.build.flash_mode=dio
garden_board_esp32c6_revision.menu.FlashMode.qio.build.boot=qio
garden_board_esp32c6_revision.menu.FlashMode.dio=DIO
garden_board_esp32c6_revision.menu.FlashMode.dio.build.flash_mode=dio
garden_board_esp32c6_revision.menu.FlashMode.dio.build.boot=dio

garden_board_esp32c6_revision.menu.FlashFreq.80=80MHz
garden_board_esp32c6_revision.menu.FlashFreq.80.build.flash_freq=80m
garden_board_esp32c6_revision.menu.FlashFreq.40=40MHz
garden_board_esp32c6_revision.menu.FlashFreq.40.build.flash_freq=40m

garden_board_esp32c6_revision.menu.UploadSpeed.921600=921600
garden_board_esp32c6_revision.menu.UploadSpeed.921600.upload.speed=921600
garden_board_esp32c6_revision.menu.UploadSpeed.115200=115200
garden_board_esp32c6_revision.menu.UploadSpeed.115200.upload.speed=115200
garden_board_esp32c6_revision.menu.UploadSpeed.256000.windows=256000
garden_board_esp32c6_revision.menu.UploadSpeed.256000.upload.speed=256000
garden_board_esp32c6_revision.menu.UploadSpeed.230400.windows.upload.speed=256000
garden_board_esp32c6_revision.menu.UploadSpeed.230400=230400
garden_board_esp32c6_revision.menu.UploadSpeed.230400.upload.speed=230400
garden_board_esp32c6_revision.menu.UploadSpeed.460800.linux=460800
garden_board_esp32c6_revision.menu.UploadSpeed.460800.macosx=460800
garden_board_esp32c6_revision.menu.UploadSpeed.460800.upload.speed=460800
garden_board_esp32c6_revision.menu.UploadSpeed.512000.windows=512000
garden_board_esp32c6_revision.menu.UploadSpeed.512000.upload.speed=512000

garden_board_esp32c6_revision.menu.DebugLevel.none=None
garden_board_esp32c6_revision.menu.DebugLevel.none.build.code_debug=0
garden_board_esp32c6_revision.menu.DebugLevel.error=Error
garden_board_esp32c6_revision.menu.DebugLevel.error.build.code_debug=1
garden_board_esp32c6_revision.menu.DebugLevel.warn=Warn
garden_board_esp32c6_revision.menu.DebugLevel.warn.build.code_debug=2
garden_board_esp32c6_revision.menu.DebugLevel.info=Info
garden_board_esp32c6_revision.menu.DebugLevel.info.build.code_debug=3
garden_board_esp32c6_revision.menu.DebugLevel.debug=Debug
garden_board_esp32c6_revision.menu.DebugLevel.debug.build.code_debug=4
garden_board_esp32c6_revision.menu.DebugLevel.verbose=Verbose
garden_board_esp32c6_revision.menu.DebugLevel.verbose.build.code_debug=5

garden_board_esp32c6_revision.menu.EraseFlash.none=Disabled
garden_board_esp32c6_revision.menu.EraseFlash.none.upload.erase_cmd=
garden_board_esp32c6_revision.menu.EraseFlash.all=Enabled
garden_board_esp32c6_revision.menu.EraseFlash.all.upload.erase_cmd=-e

garden_board_esp32c6_revision.menu.ZigbeeMode.default=Disabled
garden_board_esp32c6_revision.menu.ZigbeeMode.default.build.zigbee_mode=
garden_board_esp32c6_revision.menu.ZigbeeMode.default.build.zigbee_libs=
garden_board_esp32c6_revision.menu.ZigbeeMode.ed=Zigbee ED (end device)
garden_board_esp32c6_revision.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
garden_board_esp32c6_revision.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
garden_board_esp32c6_revision.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
garden_board_esp32c6_revision.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
garden_board_esp32c6_revision.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

#############################
# Feather C6 Debug


adafruit_feather_esp32c6_debug.name=Adafruit Feather ESP32-C6 Debug

adafruit_feather_esp32c6_debug.bootloader.tool=esptool_py
adafruit_feather_esp32c6_debug.bootloader.tool.default=esptool_py

adafruit_feather_esp32c6_debug.upload.tool=esptool_py
adafruit_feather_esp32c6_debug.upload.tool.default=esptool_py
adafruit_feather_esp32c6_debug.upload.tool.network=esp_ota

adafruit_feather_esp32c6_debug.upload.maximum_size=1310720
adafruit_feather_esp32c6_debug.upload.maximum_data_size=327680
adafruit_feather_esp32c6_debug.upload.flags=
adafruit_feather_esp32c6_debug.upload.extra_flags=
adafruit_feather_esp32c6_debug.upload.use_1200bps_touch=false
adafruit_feather_esp32c6_debug.upload.wait_for_upload_port=false

adafruit_feather_esp32c6_debug.serial.disableDTR=false
adafruit_feather_esp32c6_debug.serial.disableRTS=false

adafruit_feather_esp32c6_debug.build.tarch=riscv32
adafruit_feather_esp32c6_debug.build.target=esp
adafruit_feather_esp32c6_debug.build.mcu=esp32c6
adafruit_feather_esp32c6_debug.build.core=esp32
adafruit_feather_esp32c6_debug.build.variant=adafruit_feather_esp32c6_debug
adafruit_feather_esp32c6_debug.build.board=ADAFRUIT_FEATHER_ESP32C6_DEBUG
adafruit_feather_esp32c6_debug.build.bootloader_addr=0x0

