Sunewst/garden-board/boards.txt
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32s2_debug.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32s2_debug.menu.DebugLevel.none=None
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.error=Error
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.info=Info
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32s2_debug.menu.DebugLevel.verbose.build.code_debug=5

adafruit_qtpy_esp32s2_debug.menu.EraseFlash.none=Disabled
adafruit_qtpy_esp32s2_debug.menu.EraseFlash.none.upload.erase_cmd=
adafruit_qtpy_esp32s2_debug.menu.EraseFlash.all=Enabled
adafruit_qtpy_esp32s2_debug.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_qtpy_esp32s2_debug.menu.ZigbeeMode.default=Disabled
adafruit_qtpy_esp32s2_debug.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_qtpy_esp32s2_debug.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_qtpy_esp32s2_debug.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_qtpy_esp32s2_debug.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_qtpy_esp32s2_debug.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote
